#+BLOG: iocanel.com
#+POSTID: 504
#+DATE: [2018-10-25 Thu 14:39]
#+BLOG: iocanel.com
#+ORG2BLOG:
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+TITLE: Micronaut: Introduction
#+DESCRIPTION: Introduction to micronaut
#+CATEGORY: Development
#+TAGS: Java

** Creating a hello world example

Once the installation is complete you can create a new [[http://micronaut.io][micronaut]] application using the cli:

#+BEGIN_SRC shell
mn create-app helloworld 
#+END_SRC

#+RESULTS:
|                                     | Generating  | Java    | project... |                                                                              |
| ................................... |             |         |            |                                                                              |
|                                     | Application | created | at         | /home/iocanel/workspace/src/github.com/iocanel/blog/micronaut-pt1/helloworld |

The generated project is a [[https://docker.io][docker]]-ready [[https://gradle.org][gradle]] project that contains just a single class:

#+BEGIN_SRC java
package helloworld;

import io.micronaut.runtime.Micronaut;

public class Application {

    public static void main(String[] args) {
        Micronaut.run(Application.class);
    }
}
#+END_SRC

Note, that options are provided to select language, build tool and testing framework.

This will be very familiar to [[https://spring.io/projects/spring-boot][spring boot]] users.

Now, let's see how we can create a rest controller. From within the helloworld directory:

#+BEGIN_SRC shell :dir helloworld
mn create-controller HelloController
#+END_SRC

#+RESULTS:
|   | Rendered | template | Controller.java     | to | destination | src/main/java/helloworld/HelloController.java     |
|   | Rendered | template | ControllerTest.java | to | destination | src/test/java/helloworld/HelloControllerTest.java |

The command will generate the controller class and also a test for the controller.

The controller out of the box will just provide a single method that returns http status `OK`.
That can be easily modified, to:

#+BEGIN_SRC java
package helloworld;

import io.micronaut.http.annotation.Controller;
import io.micronaut.http.annotation.Get;

@Controller("/hello")
public class HelloController {

    @Get("/")
    public String index() {
        return "Hello World!";
    }
}
#+END_SRC

To run the application you can just use:

#+BEGIN_SRC shell :dir helloworld
./gradlew run
#+END_SRC

*** Noteworthy

It seems that its possible to specify things like language and testing framework not only on application level but also on controller level too.
So for instance we can add a second controller in kotlin:

#+BEGIN_SRC shell :dir helloworld
mn create-controller KotlinController --lang kotlin
#+END_SRC

#+RESULTS:
|   | Rendered | template | Controller.kt       | to | destination | src/main/kotlin/helloworld/KotlinController.kt     |
|   | Rendered | template | ControllerTest.java | to | destination | src/test/java/helloworld/KotlinControllerTest.java |

The code generation part worked a treat, however I wasn't able to get the kotlin controller (inside a java project) running even when I manually added the kotlin plugin inside the `build.gradle` file.

